Documents/ФормулярПервичногоДокументаПОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ФормулярПервичногоДокументаПОД</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцессаОбработкиДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаСведений</Name>
					<Comment>1 - MXL, 2 - PDF</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняемаяЗадачаСоздатель</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаПоОбработкеДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойФайл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормулярПервичногоДокументаПОДПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФормуляра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеВидаРегистраУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеРегистраУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапВыполняетсяНесколькимиИсполнителями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ФормулярПервичногоДокументаПОД/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЗаголовокФормуляра(Формуляр) Экспорт
	Результат = "";
	
	Реквизиты = "Организация, НаименованиеДокумента, НомерДокумента, ДатаДокумента, НаименованиеВидаРегистраУчета, ОписаниеРегистраУчета, НачалоПериода, КонецПериода";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Формуляр, Реквизиты);
	
	Если ЗначениеЗаполнено(ЗначенияРеквизитов.НаименованиеВидаРегистраУчета) Тогда
		ПериодРегистраУчета = "";
		Если ЗначениеЗаполнено(ЗначенияРеквизитов.НачалоПериода) Тогда
			ПериодРегистраУчета = ЗначенияРеквизитов.НачалоПериода;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЗначенияРеквизитов.КонецПериода) Тогда
			ПериодРегистраУчета = ЗначенияРеквизитов.КонецПериода;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЗначенияРеквизитов.НачалоПериода) И ЗначениеЗаполнено(ЗначенияРеквизитов.КонецПериода) Тогда
			ПериодРегистраУчета = СтрШаблон("%1 - %2", ЗначенияРеквизитов.НачалоПериода, ЗначенияРеквизитов.КонецПериода);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПериодРегистраУчета) Тогда
			Результат = СтрШаблон("Регистр учета %1 %2 (%3)", 
				ЗначенияРеквизитов.НаименованиеВидаРегистраУчета,
				ЗначенияРеквизитов.ОписаниеРегистраУчета,
				ПериодРегистраУчета);
		Иначе
			Результат = СтрШаблон("Регистр учета %1 %2", 
				ЗначенияРеквизитов.НаименованиеВидаРегистраУчета,
				ЗначенияРеквизитов.ОписаниеРегистраУчета);
		КонецЕсли;	
	Иначе
		Результат = СтрШаблон("%1 от %2 № %3", 
			ЗначенияРеквизитов.НаименованиеДокумента,
			ЗначенияРеквизитов.ДатаДокумента,
			ЗначенияРеквизитов.НомерДокумента);
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("НаименованиеДокумента");
	Поля.Добавить("НомерДокумента");
	Поля.Добавить("ДатаДокумента");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеФормуляраПоСвойствам(Данные);
	
КонецПроцедуры

#КонецОбласти
